<a href="https://colab.research.google.com/github/GustavoHDLC1/Colab_Files_PADP/blob/main/Sem5_Practica14.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Práctica 14: Limpieza y Transformación de Datos Categóricos
[Enlace GitHub](https://github.com/GustavoHDLC1/Colab_Files_PADP/blob/main/Sem5_Practica14.ipynb)

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/content/drive/MyDrive/MIAAD/PADP/nls97.csv')
df

,personid,gender,birthmonth,birthyear,highestgradecompleted,maritalstatus,childathome,childnotathome,wageincome,weeklyhrscomputer,...,colenrfeb13,colenroct13,colenrfeb14,colenroct14,colenrfeb15,colenroct15,colenrfeb16,colenroct16,colenrfeb17,colenroct17
0,100061,Female,5,1980,13.0,Married,4.0,0.0,12500.0,10 hours or more a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
1,100139,Male,9,1983,12.0,Married,2.0,0.0,120000.0,1 to 3 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
2,100284,Male,11,1984,7.0,Never-married,1.0,0.0,58000.0,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
3,100292,Male,4,1982,NaN,NaN,NaN,NaN,NaN,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,NaN,NaN,NaN
4,100583,Male,1,1980,13.0,Married,4.0,0.0,30000.0,Less than 1 hour a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8979,999291,Female,4,1981,16.0,Married,NaN,NaN,35000.0,7 to 9 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
8980,999406,Male,7,1982,14.0,Never-married,NaN,NaN,116000.0,4 to 6 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
8981,999543,Female,8,1984,12.0,Divorced,2.0,0.0,NaN,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
8982,999698,Female,5,1983,12.0,Never-married,5.0,0.0,NaN,4 to 6 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
8983,999963,Female,9,1982,17.0,Married,2.0,0.0,50000.0,4 to 6 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled

## Ejercicio 01: Errores Tipográficos y Valores Inconsistentes: maritalstatus

In [3]:
# Imprime de la columna 'maritalstatus' los valores únicos.
print(df['maritalstatus'].unique())

['Married' 'Never-married' nan 'Divorced' 'Separated' 'Widowed']

In [4]:
# Imprime la frecuencia de cada valor único
df['maritalstatus'].value_counts()

maritalstatus
Married          3066
Never-married    2766
Divorced          663
Separated         154
Widowed            23
Name: count, dtype: int64

In [5]:
# Cambia el valor 'Never-Married' a 'Single'
df['maritalstatus'] = df['maritalstatus'].replace('Never-married', 'Single')

In [6]:
# Imprime la frecuencia de cada valor único
df['maritalstatus'].value_counts()

maritalstatus
Married      3066
Single       2766
Divorced      663
Separated     154
Widowed        23
Name: count, dtype: int64

## Ejercicio 02: Errores Tipográficos y Valores Inconsistentes: highestdegree.

In [7]:
# Imprime de la columna 'highestdegrees' los valores únicos.
print(df['highestdegree'].unique())

['2. High School' '0. None' '4. Bachelors' '3. Associates' '5. Masters'
 '1. GED' '7. Professional' '6. PhD' nan]

In [8]:
df['highestdegree'].value_counts()

highestdegree
2. High School     3667
4. Bachelors       1673
1. GED             1146
0. None             953
3. Associates       737
5. Masters          603
7. Professional     120
6. PhD               54
Name: count, dtype: int64

In [9]:
# Modifica las categorías para que todas estén en minúsculas y ninguna empiece con un número
df["highestdegree"] = df["highestdegree"].str.replace(r'[^a-zA-Z\s]', '', regex=True).str.lower()

In [10]:
# Imprime los nuevos valores únicos
df["highestdegree"].value_counts()

highestdegree
high school     3667
bachelors       1673
ged             1146
none             953
associates       737
masters          603
professional     120
phd               54
Name: count, dtype: int64

## Ejercicio 03: Alta Cardinalidad - Frecuencias Bajas

In [11]:
# De la columna 'maritalstatus' une las categorías Widowed y 'Single' en una categoría más general llamada 'Single/No Partner'.
# Crea una nueva columna, 'marital_grouped' donde aparezcan las nuevas categorías de maritalstatus.
df['marital_grouped'] = df['maritalstatus'].apply(lambda x: 'Single/No Partner' if x in ['Widowed','Single'] else x)

In [12]:
# Imprime los valores únicos de la nueva columna 'marital_grouped'.
print(df['marital_grouped'].unique())

['Married' 'Single/No Partner' nan 'Divorced' 'Separated']

In [13]:
# Imprime la frecuencia de los valores únicos de la nueva columna 'marital_grouped'
df['marital_grouped'].value_counts()

marital_grouped
Married              3066
Single/No Partner    2789
Divorced              663
Separated             154
Name: count, dtype: int64

## Ejercicio 04: Tipos de Datos

In [14]:
# Imprime el tipo de datos de la columna gender
df['gender'].dtype

dtype('O')

In [15]:
# Imprime la cantidad de bytes de dicha columna
df[['gender']].memory_usage(deep=True)

Index        132
gender    484922
dtype: int64

In [16]:
print(df[['gender']].memory_usage(deep=True).sum())

485054

In [17]:
# Si la columna es de tipo object, modifica a category.
df['gender'] = df['gender'].astype("category")

In [18]:
# En caso de haber realizado la modificación del tipo de datos,
# imprime la cantidad de bytes que ocupa dicha columna con el nuevo tipo de datos
df[['gender']].memory_usage(deep=True)

Index      132
gender    9200
dtype: int64

In [19]:
print(df[['gender']].memory_usage(deep=True).sum())

9332